<a href="https://colab.research.google.com/github/ColdCoffee21/Amrita-Quizzes/blob/master/Lab_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
data = pd.read_csv('/content/drive/My Drive/Data Science/uk-500.csv')

###Dataframe indexing

In [ ]:
data.iloc[0]

first_name                                   Aleshia
last_name                                 Tomkiewicz
company_name                 Alan D Rosenburg Cpa Pc
address                                 14 Taylor St
city                               St. Stephens Ward
county                                          Kent
postal                                       CT2 7PP
phone1                                  01835-703597
phone2                                  01944-369967
email                        atomkiewicz@hotmail.com
web             http://www.alandrosenburgcpapc.co.uk
Name: 0, dtype: object

In [ ]:
data.iloc[1]

first_name                                   Evan
last_name                               Zigomalas
company_name                   Cap Gemini America
address                               5 Binney St
city                                   Abbey Ward
county                            Buckinghamshire
postal                                   HP11 2AX
phone1                               01937-864715
phone2                               01714-737668
email                    evan.zigomalas@gmail.com
web             http://www.capgeminiamerica.co.uk
Name: 1, dtype: object

In [ ]:
data.iloc[-1]

first_name                                               Mi
last_name                                            Richan
company_name                 Nelson Wright Haworth Golf Crs
address                                     6 Norwood Grove
city                                      Tanworth-in-Arden
county                                         Warwickshire
postal                                              B94 5RZ
phone1                                         01451-785624
phone2                                         01202-738406
email                                        mi@hotmail.com
web             http://www.nelsonwrighthaworthgolfcrs.co.uk
Name: 499, dtype: object

In [ ]:
#selecting columns
data.iloc[:,0]

0        Aleshia
1           Evan
2         France
3        Ulysses
4         Tyisha
         ...
495        Avery
496         Reid
497    Charlette
498    Celestina
499           Mi
Name: first_name, Length: 500, dtype: object

In [ ]:
data.iloc[:,1]

0      Tomkiewicz
1       Zigomalas
2         Andrade
3       Mcwalters
4          Veness
          ...
495          Veit
496       Euresti
497      Brenning
498         Keeny
499        Richan
Name: last_name, Length: 500, dtype: object

In [ ]:
data.iloc[:,-1]

0             http://www.alandrosenburgcpapc.co.uk
1                http://www.capgeminiamerica.co.uk
2                 http://www.elliottjohnwesq.co.uk
3                     http://www.mcmahanbenl.co.uk
4                   http://www.champagneroom.co.uk
                          ...
495      http://www.plazagourmetdelicatessen.co.uk
496             http://www.fitzgeraldedwardj.co.uk
497               http://www.fureyassociates.co.uk
498         http://www.bfgfederalcreditunion.co.uk
499    http://www.nelsonwrighthaworthgolfcrs.co.uk
Name: web, Length: 500, dtype: object

In [ ]:
#first upto n rows select
data.iloc[0:5] #0,1,2,3,4

  first_name  ...                                   web
0    Aleshia  ...  http://www.alandrosenburgcpapc.co.uk
1       Evan  ...     http://www.capgeminiamerica.co.uk
2     France  ...      http://www.elliottjohnwesq.co.uk
3    Ulysses  ...          http://www.mcmahanbenl.co.uk
4     Tyisha  ...        http://www.champagneroom.co.uk

[5 rows x 11 columns]

In [ ]:
#first two columns
data.iloc[:,0:2]

    first_name   last_name
0      Aleshia  Tomkiewicz
1         Evan   Zigomalas
2       France     Andrade
3      Ulysses   Mcwalters
4       Tyisha      Veness
..         ...         ...
495      Avery        Veit
496       Reid     Euresti
497  Charlette    Brenning
498  Celestina       Keeny
499         Mi      Richan

[500 rows x 2 columns]

In [ ]:
data.iloc[[0,3,6,24],[0,5,6]]

   first_name        county    postal
0     Aleshia          Kent   CT2 7PP
3     Ulysses  Lincolnshire  DN36 5RP
6        Marg   Southampton  SO14 3TY
24       Tess   West Sussex  PO19 1RH

In [ ]:
data.iloc[0:5,5:8]

            county    postal        phone1
0             Kent   CT2 7PP  01835-703597
1  Buckinghamshire  HP11 2AX  01937-864715
2      Bournemouth   BH6 3BE  01347-368222
3     Lincolnshire  DN36 5RP  01912-771311
4    West Midlands   B70 9DT  01547-429341

In [ ]:
data.set_index("last_name",inplace=True)
data.head()

           first_name  ...                                   web
last_name              ...
Tomkiewicz    Aleshia  ...  http://www.alandrosenburgcpapc.co.uk
Zigomalas        Evan  ...     http://www.capgeminiamerica.co.uk
Andrade        France  ...      http://www.elliottjohnwesq.co.uk
Mcwalters     Ulysses  ...          http://www.mcmahanbenl.co.uk
Veness         Tyisha  ...        http://www.champagneroom.co.uk

[5 rows x 10 columns]

In [ ]:
#inclues the nth row/column as well
data.loc[['Andrade', 'Veness'],'city':'email']

                                     city  ...                       email
last_name                                  ...
Andrade    East Southbourne and Tuckton W  ...  france.andrade@hotmail.com
Veness         Greets Green and Lyng Ward  ...   tyisha.veness@hotmail.com

[2 rows x 6 columns]

In [ ]:

data.loc['Andrade': 'Veness',['first_name','city','address']]

          first_name                            city            address
last_name
Andrade       France  East Southbourne and Tuckton W       8 Moor Place
Mcwalters    Ulysses              Hawerby cum Beesby      505 Exeter Rd
Veness        Tyisha      Greets Green and Lyng Ward  5396 Forth Street

In [ ]:
data.loc[data['first_name']=='Antonio', 'city':'email']

                                      city  ...                            email
last_name                                   ...
Villamarin  Little Parndon and Hare Street  ...     antonio.villamarin@gmail.com
Glasford                    Gaer Community  ...  antonio_glasford@glasford.co.uk
Heilig                            Ipplepen  ...         antonio.heilig@gmail.com

[3 rows x 6 columns]

In [ ]:
data.loc[((data['county']=='Kent') & (data['first_name']=='Aleshia')),'city':'email']

                         city county  ...        phone2                    email
last_name                             ...
Tomkiewicz  St. Stephens Ward   Kent  ...  01944-369967  atomkiewicz@hotmail.com

[1 rows x 6 columns]

In [ ]:
data.loc[data['email'].str.endswith("gmail.com")]

            first_name  ...                                      web
last_name               ...
Zigomalas         Evan  ...        http://www.capgeminiamerica.co.uk
Erm        Charlesetta  ...            http://www.cainjohnmesq.co.uk
Jaret         Corrinne  ...         http://www.soundvisioncorp.co.uk
Quarto           Karma  ...            http://www.jcsmachinery.co.uk
Savidge          Milly  ...  http://www.bridgewayplanforhealth.co.uk
...                ...  ...                                      ...
Picciuto           Mel  ...           http://www.avantelimited.co.uk
Machalek       Tijuana  ...      http://www.schwartzthomaseesq.co.uk
Dolloff        Derrick  ...   http://www.prototekmanufacturing.co.uk
Katie           Alesia  ...  http://www.nelsonstrmtpestcntrlco.co.uk
Keeny        Celestina  ...   http://www.bfgfederalcreditunion.co.uk

[130 rows x 10 columns]

In [ ]:
data.loc[data['first_name'].isin(['France', 'Tyisha', 'Eric'])]

          first_name  ...                                   web
last_name             ...
Andrade       France  ...      http://www.elliottjohnwesq.co.uk
Veness        Tyisha  ...        http://www.champagneroom.co.uk
Rampy           Eric  ...  http://www.thompsonmichaelcesq.co.uk

[3 rows x 10 columns]

In [ ]:
data.loc[data['email'].str.endswith("gmail.com") & (data['first_name'] == 'Antonio')]

           first_name  ...                                  web
last_name              ...
Villamarin    Antonio  ...     http://www.combssheetmetal.co.uk
Heilig        Antonio  ...  http://www.radissonsuitehotel.co.uk

[2 rows x 10 columns]

In [ ]:
data.loc[data['company_name'].apply(lambda x: len(x.split(' '))==4)]

            first_name  ...                                         web
last_name               ...
Andrade         France  ...            http://www.elliottjohnwesq.co.uk
Rampy             Eric  ...        http://www.thompsonmichaelcesq.co.uk
Erm        Charlesetta  ...               http://www.cainjohnmesq.co.uk
Throssell      Michell  ...            http://www.weissspirtguyer.co.uk
Kanne            Edgar  ...          http://www.crowankennethwesq.co.uk
...                ...  ...                                         ...
Alsaqri          Ahmad  ...  http://www.allianceconstructioncoinc.co.uk
Reibman     Jacquelyne  ...          http://www.greatclipsforhair.co.uk
Kono          Isabelle  ...  http://www.rockspringspetroleumequip.co.uk
Fiorino         Elbert  ...           http://www.donaldgnelsonesq.co.uk
Keeny        Celestina  ...      http://www.bfgfederalcreditunion.co.uk

[192 rows x 10 columns]

In [ ]:
data.loc[data['county']=='Kent',['first_name']] = "Dheeraj"

In [ ]:
data.loc[((data['county']=='Kent') & (data['first_name']=='Dheeraj'))]

           first_name  ...                                          web
last_name              ...
Tomkiewicz    Dheeraj  ...         http://www.alandrosenburgcpapc.co.uk
Writer        Dheeraj  ...             http://www.krassociatesinc.co.uk
Thurm         Dheeraj  ...    http://www.burgesssteelproductscorp.co.uk
Dease         Dheeraj  ...      http://www.sunderlandpublishingco.co.uk
Crete         Dheeraj  ...                  http://www.mdwrailway.co.uk
Yurich        Dheeraj  ...    http://www.blainecostructuralmovers.co.uk
Wendorf       Dheeraj  ...      http://www.russellameliamosleyesq.co.uk
Puskarich     Dheeraj  ...           http://www.drubnernormansesq.co.uk
Geschke       Dheeraj  ...  http://www.levysecurityconsultantsltd.co.uk
Handsaker     Dheeraj  ...         http://www.shirleysprintshoppe.co.uk
Dubberly      Dheeraj  ...    http://www.lmindustrialchemicalsinc.co.uk
Shadd         Dheeraj  ...        http://www.pigeonfallsstatebank.co.uk
Sheneman      Dheeraj  ...            http://www.jonesbrighampesq.co.uk
Colamarino    Dheeraj  ...         http://www.proctorassociatesco.co.uk
Mercik        Dheeraj  ...                  http://www.leestandvm.co.uk
Flori         Dheeraj  ...   http://www.marinesafetyinternational.co.uk
Maricle       Dheeraj  ...           http://www.gartonjeffreypesq.co.uk
Kernagis      Dheeraj  ...         http://www.digitalsolutionsinc.co.uk
Leadbeater    Dheeraj  ...    http://www.murraywhisnantarchitects.co.uk
Farrin        Dheeraj  ...             http://www.deringjameseesq.co.uk
Humeniuk      Dheeraj  ...    http://www.guldstrandengineeringinc.co.uk
Tischner      Dheeraj  ...                http://www.malepowerltd.co.uk

[22 rows x 10 columns]

In [ ]:
data.loc[(data['first_name']=='Dheeraj'), ['company_name','city']] = ['Chennai', 'Student']

In [ ]:
data.loc[(data['first_name']=='Dheeraj')]

           first_name  ...                                          web
last_name              ...
Tomkiewicz    Dheeraj  ...         http://www.alandrosenburgcpapc.co.uk
Writer        Dheeraj  ...             http://www.krassociatesinc.co.uk
Thurm         Dheeraj  ...    http://www.burgesssteelproductscorp.co.uk
Dease         Dheeraj  ...      http://www.sunderlandpublishingco.co.uk
Crete         Dheeraj  ...                  http://www.mdwrailway.co.uk
Yurich        Dheeraj  ...    http://www.blainecostructuralmovers.co.uk
Wendorf       Dheeraj  ...      http://www.russellameliamosleyesq.co.uk
Puskarich     Dheeraj  ...           http://www.drubnernormansesq.co.uk
Geschke       Dheeraj  ...  http://www.levysecurityconsultantsltd.co.uk
Handsaker     Dheeraj  ...         http://www.shirleysprintshoppe.co.uk
Dubberly      Dheeraj  ...    http://www.lmindustrialchemicalsinc.co.uk
Shadd         Dheeraj  ...        http://www.pigeonfallsstatebank.co.uk
Sheneman      Dheeraj  ...            http://www.jonesbrighampesq.co.uk
Colamarino    Dheeraj  ...         http://www.proctorassociatesco.co.uk
Mercik        Dheeraj  ...                  http://www.leestandvm.co.uk
Flori         Dheeraj  ...   http://www.marinesafetyinternational.co.uk
Maricle       Dheeraj  ...           http://www.gartonjeffreypesq.co.uk
Kernagis      Dheeraj  ...         http://www.digitalsolutionsinc.co.uk
Leadbeater    Dheeraj  ...    http://www.murraywhisnantarchitects.co.uk
Farrin        Dheeraj  ...             http://www.deringjameseesq.co.uk
Humeniuk      Dheeraj  ...    http://www.guldstrandengineeringinc.co.uk
Tischner      Dheeraj  ...                http://www.malepowerltd.co.uk

[22 rows x 10 columns]

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/fivethirtyeight/data/master/cabinet-turnover/cabinet-turnover.csv')

In [ ]:
df.head()

  president                                  position  ... length   days
0    Carter                              OMB Director  ...    245  247.0
1    Carter               Secretary of Transportation  ...    908  912.0
2    Carter  Secretary of Health, Education & Welfare  ...    920  926.0
3    Carter  Secretary of Housing & Urban Development  ...    922  926.0
4    Carter                 Secretary of the Treasury  ...    923  927.0

[5 rows x 7 columns]

In [ ]:
df.dtypes

president     object
position      object
appointee     object
start         object
end           object
length        object
days         float64
dtype: object

In [ ]:
df.shape

(312, 7)

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 312 entries, 0 to 311
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   president  312 non-null    object
 1   position   312 non-null    object
 2   appointee  312 non-null    object
 3   start      312 non-null    object
 4   end        312 non-null    object
 5   length     294 non-null    object
 6   days       288 non-null    float64
dtypes: float64(1), object(6)
memory usage: 17.2+ KB

In [ ]:
df.head()

  president                                  position  ... length   days
0    Carter                              OMB Director  ...    245  247.0
1    Carter               Secretary of Transportation  ...    908  912.0
2    Carter  Secretary of Health, Education & Welfare  ...    920  926.0
3    Carter  Secretary of Housing & Urban Development  ...    922  926.0
4    Carter                 Secretary of the Treasury  ...    923  927.0

[5 rows x 7 columns]

In [ ]:
df['president'].nunique()

7

In [ ]:
#OMb directors in the period of clinton, number of presidents, and secretaries
df.loc[df.position.str.contains("Secretary")]

    president                                  position  ... length   days
1      Carter               Secretary of Transportation  ...    908  912.0
2      Carter  Secretary of Health, Education & Welfare  ...    920  926.0
3      Carter  Secretary of Housing & Urban Development  ...    922  926.0
4      Carter                 Secretary of the Treasury  ...    923  927.0
7      Carter                       Secretary of Energy  ...    747  946.0
..        ...                                       ...  ...    ...    ...
305     Trump                        Secretary of Labor  ...    NaN    NaN
307     Trump            Secretary of Homeland Security  ...    NaN    NaN
308     Trump      Secretary of Health & Human Services  ...    NaN    NaN
309     Trump                        Secretary of State  ...    NaN    NaN
311     Trump             Secretary of Veterans Affairs  ...    NaN    NaN

[175 rows x 7 columns]

In [ ]:
df.loc[(df['president']=='Clinton') & (df.position.str.contains("OMB Director"))]['appointee']

122    Leon Panetta
129    Alice Rivlin
142    Frank Raines
151        Jack Lew
Name: appointee, dtype: object

In [ ]:
df2 = pd.read_csv('https://raw.githubusercontent.com/akki8087/Big-Mart-Sales/master/Train.csv')

In [ ]:
df2.head()

  Item_Identifier  Item_Weight  ...        Outlet_Type  Item_Outlet_Sales
0           FDA15         9.30  ...  Supermarket Type1          3735.1380
1           DRC01         5.92  ...  Supermarket Type2           443.4228
2           FDN15        17.50  ...  Supermarket Type1          2097.2700
3           FDX07        19.20  ...      Grocery Store           732.3800
4           NCD19         8.93  ...  Supermarket Type1           994.7052

[5 rows x 12 columns]

In [ ]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8523 entries, 0 to 8522
Data columns (total 12 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Item_Identifier            8523 non-null   object
 1   Item_Weight                7060 non-null   float64
 2   Item_Fat_Content           8523 non-null   object
 3   Item_Visibility            8523 non-null   float64
 4   Item_Type                  8523 non-null   object
 5   Item_MRP                   8523 non-null   float64
 6   Outlet_Identifier          8523 non-null   object
 7   Outlet_Establishment_Year  8523 non-null   int64
 8   Outlet_Size                6113 non-null   object
 9   Outlet_Location_Type       8523 non-null   object
 10  Outlet_Type                8523 non-null   object
 11  Item_Outlet_Sales          8523 non-null   float64
dtypes: float64(4), int64(1), object(7)
memory usage: 799.2+ KB

In [ ]:
df2.apply(lambda x: x[0])

Item_Identifier                          FDA15
Item_Weight                                9.3
Item_Fat_Content                       Low Fat
Item_Visibility                      0.0160473
Item_Type                                Dairy
Item_MRP                               249.809
Outlet_Identifier                       OUT049
Outlet_Establishment_Year                 1999
Outlet_Size                             Medium
Outlet_Location_Type                    Tier 1
Outlet_Type                  Supermarket Type1
Item_Outlet_Sales                      3735.14
dtype: object

In [ ]:
df2.apply(lambda x: x[0],axis=1)

0       FDA15
1       DRC01
2       FDN15
3       FDX07
4       NCD19
        ...
8518    FDF22
8519    FDS36
8520    NCJ29
8521    FDN46
8522    DRG01
Length: 8523, dtype: object

In [ ]:
def clip_price(price):
  if price>200:
    price=200
  return price

In [ ]:
df2['Item_MRP'][:5]

0    249.8092
1     48.2692
2    141.6180
3    182.0950
4     53.8614
Name: Item_MRP, dtype: float64

In [ ]:
df2['Item_MRP']=df2['Item_MRP'].apply(lambda x: clip_price(x))[:5]

In [ ]:
df2['Item_MRP']=df2['Item_MRP'].apply(clip_price)

In [ ]:
df2

     Item_Identifier  Item_Weight  ...        Outlet_Type  Item_Outlet_Sales
0              FDA15        9.300  ...  Supermarket Type1          3735.1380
1              DRC01        5.920  ...  Supermarket Type2           443.4228
2              FDN15       17.500  ...  Supermarket Type1          2097.2700
3              FDX07       19.200  ...      Grocery Store           732.3800
4              NCD19        8.930  ...  Supermarket Type1           994.7052
...              ...          ...  ...                ...                ...
8518           FDF22        6.865  ...  Supermarket Type1          2778.3834
8519           FDS36        8.380  ...  Supermarket Type1           549.2850
8520           NCJ29       10.600  ...  Supermarket Type1          1193.1136
8521           FDN46        7.210  ...  Supermarket Type2          1845.5976
8522           DRG01       14.800  ...  Supermarket Type1           765.6700

[8523 rows x 12 columns]

In [ ]:
def label_encode(city):
  if city=='Tier 1':
    label = 0
  elif city=='Tier 2':
    label = 1
  else:
    label = 2
  return label

In [ ]:
df2['Outlet_Location_Type'][:5]

0    Tier 1
1    Tier 3
2    Tier 1
3    Tier 3
4    Tier 3
Name: Outlet_Location_Type, dtype: object

In [ ]:
df2['Outlet_Location_Type']=df2['Outlet_Location_Type'].apply(label_encode)

In [ ]:
df2['Outlet_Location_Type'][:5]

0    0
1    2
2    0
3    2
4    2
Name: Outlet_Location_Type, dtype: int64

In [ ]:
df3 = pd.read_html('https://www.contextures.com/xlSampleData01.html', header = 0)

In [ ]:
len(df3)

1

In [ ]:
df4 = df3[0]

In [ ]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 44 entries, 0 to 43
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       44 non-null     object
 1   1       44 non-null     object
 2   2       44 non-null     object
 3   3       44 non-null     object
 4   4       44 non-null     object
 5   5       44 non-null     object
 6   6       44 non-null     object
dtypes: object(7)
memory usage: 2.5+ KB

In [ ]:
df4.head()

   OrderDate   Region      Rep    Item  Units  UnitCost   Total
0   1/6/2019     East    Jones  Pencil     95      1.99  189.05
1  1/23/2019  Central   Kivell  Binder     50     19.99  999.50
2   2/9/2019  Central  Jardine  Pencil     36      4.99  179.64
3  2/26/2019  Central     Gill     Pen     27     19.99  539.73
4  3/15/2019     West  Sorvino  Pencil     56      2.99  167.44

In [ ]:
len(df4[df4['Item'] == 'Pencil'])

13

In [ ]:
df4.describe()

           Units    UnitCost        Total
count  43.000000   43.000000    43.000000
mean   49.325581   20.308605   456.462326
std    30.078248   47.345118   447.022104
min     2.000000    1.290000     9.030000
25%    27.500000    3.990000   144.590000
50%    53.000000    4.990000   299.400000
75%    74.500000   17.990000   600.180000
max    96.000000  275.000000  1879.060000

In [ ]:
df3 = pd.read_html('https://www.espncricinfo.com/india/content/player/253802.html', header = 0, index_col=0)

In [ ]:
df3[0].head()

             Mat  Inns  NO   Runs    HS    Ave  ...  100  50    4s   6s   Ct  St
Tests         86   145  10   7240  254*  53.62  ...   27  22   811   22   82   0
ODIs         248   239  39  11867   183  59.33  ...   43  58  1116  121  128   0
T20Is         82    76  21   2794   94*  50.80  ...    0  24   258   76   41   0
First-class  118   193  17   9489  254*  53.91  ...   34  30  1124   37  113   0
List A       282   272  42  13309   183  57.86  ...   47  66  1280  145  146   0

[5 rows x 14 columns]

In [ ]:
df4 = df3[0]

In [ ]:
df4['4s'].sum()

5397

##Missing values

In [ ]:
df5 = pd.read_csv('https://raw.githubusercontent.com/dataoptimal/posts/master/data%20cleaning%20with%20python%20and%20pandas/property%20data.csv')

In [ ]:
df5

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y            1        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

In [ ]:
df5.dtypes

PID             float64
ST_NUM          float64
ST_NAME          object
OWN_OCCUPIED     object
NUM_BEDROOMS     object
NUM_BATH         object
SQ_FT            object
dtype: object

In [ ]:
df5['ST_NUM'].isnull()

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
8    False
Name: ST_NUM, dtype: bool

In [ ]:
df5['SQ_FT'].isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
8    False
Name: SQ_FT, dtype: bool

In [ ]:
missing_values=['--','na','n/a']
df6 = pd.read_csv('https://raw.githubusercontent.com/dataoptimal/posts/master/data%20cleaning%20with%20python%20and%20pandas/property%20data.csv', na_values=missing_values)
df6

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY           12           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [ ]:
df6.dtypes

PID             float64
ST_NUM          float64
ST_NAME          object
OWN_OCCUPIED     object
NUM_BEDROOMS    float64
NUM_BATH         object
SQ_FT           float64
dtype: object

In [ ]:
df6['SQ_FT'].isnull()

0    False
1     True
2    False
3    False
4    False
5    False
6    False
7     True
8    False
Name: SQ_FT, dtype: bool